In [23]:
import pandas as pd

In [24]:
df=pd.read_csv("../Global_Financial_Analysis/Global_Financial_Data.csv")

In [25]:
df

,Unnamed: 0.1,Unnamed: 0,Date,Close,High,Low,Open,Volume,Company,Country
0,0,0,2025-01-01,1216.391846,1221.421805,1206.780209,1210.017281,5892590,Reliance,India
1,1,1,2025-01-02,1236.860107,1239.499468,1215.146780,1216.391808,15486276,Reliance,India
2,2,2,2025-01-03,1246.172974,1257.029638,1230.585205,1238.951814,15521102,Reliance,India
3,3,3,2025-01-06,1213.154785,1256.979753,1210.166719,1248.961727,14816766,Reliance,India
4,4,4,2025-01-07,1235.913818,1239.549323,1216.391812,1217.138829,10070505,Reliance,India
...,...,...,...,...,...,...,...,...,...,...
41198,5495,5495,2026-02-13,1601.000000,1618.500000,1591.500000,1600.000000,21236200,Honda,Tokyo
41199,5496,5496,2026-02-16,1555.500000,1603.000000,1555.500000,1600.000000,22176600,Honda,Tokyo
41200,5497,5497,2026-02-17,1570.500000,1594.000000,1570.500000,1580.000000,13335400,Honda,Tokyo
41201,5498,5498,2026-02-18,1582.500000,1593.500000,1574.000000,1588.000000,11565500,Honda,Tokyo
41202,5499,5499,2026-02-19,1581.500000,1597.000000,1572.500000,1580.000000,13364600,Honda,Tokyo

In [26]:
df=df.drop('Unnamed: 0.1', axis=1)

In [27]:
df

,Unnamed: 0,Date,Close,High,Low,Open,Volume,Company,Country
0,0,2025-01-01,1216.391846,1221.421805,1206.780209,1210.017281,5892590,Reliance,India
1,1,2025-01-02,1236.860107,1239.499468,1215.146780,1216.391808,15486276,Reliance,India
2,2,2025-01-03,1246.172974,1257.029638,1230.585205,1238.951814,15521102,Reliance,India
3,3,2025-01-06,1213.154785,1256.979753,1210.166719,1248.961727,14816766,Reliance,India
4,4,2025-01-07,1235.913818,1239.549323,1216.391812,1217.138829,10070505,Reliance,India
...,...,...,...,...,...,...,...,...,...
41198,5495,2026-02-13,1601.000000,1618.500000,1591.500000,1600.000000,21236200,Honda,Tokyo
41199,5496,2026-02-16,1555.500000,1603.000000,1555.500000,1600.000000,22176600,Honda,Tokyo
41200,5497,2026-02-17,1570.500000,1594.000000,1570.500000,1580.000000,13335400,Honda,Tokyo
41201,5498,2026-02-18,1582.500000,1593.500000,1574.000000,1588.000000,11565500,Honda,Tokyo
41202,5499,2026-02-19,1581.500000,1597.000000,1572.500000,1580.000000,13364600,Honda,Tokyo

In [28]:
df=df.drop('Unnamed: 0', axis=1)

In [29]:
df

,Date,Close,High,Low,Open,Volume,Company,Country
0,2025-01-01,1216.391846,1221.421805,1206.780209,1210.017281,5892590,Reliance,India
1,2025-01-02,1236.860107,1239.499468,1215.146780,1216.391808,15486276,Reliance,India
2,2025-01-03,1246.172974,1257.029638,1230.585205,1238.951814,15521102,Reliance,India
3,2025-01-06,1213.154785,1256.979753,1210.166719,1248.961727,14816766,Reliance,India
4,2025-01-07,1235.913818,1239.549323,1216.391812,1217.138829,10070505,Reliance,India
...,...,...,...,...,...,...,...,...
41198,2026-02-13,1601.000000,1618.500000,1591.500000,1600.000000,21236200,Honda,Tokyo
41199,2026-02-16,1555.500000,1603.000000,1555.500000,1600.000000,22176600,Honda,Tokyo
41200,2026-02-17,1570.500000,1594.000000,1570.500000,1580.000000,13335400,Honda,Tokyo
41201,2026-02-18,1582.500000,1593.500000,1574.000000,1588.000000,11565500,Honda,Tokyo
41202,2026-02-19,1581.500000,1597.000000,1572.500000,1580.000000,13364600,Honda,Tokyo

In [30]:
df.Date =df.Date.astype('datetime64[ns]')

In [31]:
df

,Date,Close,High,Low,Open,Volume,Company,Country
0,2025-01-01,1216.391846,1221.421805,1206.780209,1210.017281,5892590,Reliance,India
1,2025-01-02,1236.860107,1239.499468,1215.146780,1216.391808,15486276,Reliance,India
2,2025-01-03,1246.172974,1257.029638,1230.585205,1238.951814,15521102,Reliance,India
3,2025-01-06,1213.154785,1256.979753,1210.166719,1248.961727,14816766,Reliance,India
4,2025-01-07,1235.913818,1239.549323,1216.391812,1217.138829,10070505,Reliance,India
...,...,...,...,...,...,...,...,...
41198,2026-02-13,1601.000000,1618.500000,1591.500000,1600.000000,21236200,Honda,Tokyo
41199,2026-02-16,1555.500000,1603.000000,1555.500000,1600.000000,22176600,Honda,Tokyo
41200,2026-02-17,1570.500000,1594.000000,1570.500000,1580.000000,13335400,Honda,Tokyo
41201,2026-02-18,1582.500000,1593.500000,1574.000000,1588.000000,11565500,Honda,Tokyo
41202,2026-02-19,1581.500000,1597.000000,1572.500000,1580.000000,13364600,Honda,Tokyo